use strict;
use utf8;
my %seen;
my $bpmf = {
  "1"=> "ㄅ", "q"=> "ㄆ", "a"=> "ㄇ", "z"=> "ㄈ", 
  "2"=> "ㄉ", "w"=> "ㄊ", "s"=> "ㄋ", "x"=> "ㄌ",
  "e"=> "ㄍ", "d"=> "ㄎ", "c"=> "ㄏ",
  "r"=> "ㄐ", "f"=> "ㄑ", "v"=> "ㄒ",
  "5"=> "ㄓ", "t"=> "ㄔ", "g"=> "ㄕ", "b"=> "ㄖ",
  "y"=> "ㄗ", "h"=> "ㄘ", "n"=> "ㄙ",

  "u"=> "ㄧ", "j"=> "ㄨ", "m"=> "ㄩ",

  "8"=> "ㄚ", "i"=> "ㄛ", "k"=> "ㄜ", ","=> "ㄝ",
  "9"=> "ㄞ", "o"=> "ㄟ", "l"=> "ㄠ", "."=> "ㄡ",
  "0"=> "ㄢ", "p"=> "ㄣ", ";"=> "ㄤ", "/"=> "ㄥ",
  "-"=> "ㄦ" , "'"=> "ㄇ〾", "Y"=>"ㆡ",

  "!"=> "ㆠ", "A"=> "ㆬ", "@"=> "ㄉ〾", "E"=> "ㆣ",
  "C"=> "ㄬ", "R"=> "ㆢ",

  "U"=> "ㆪ", "J"=> "ㆫ", "*"=> "ㆩ", "K"=> "ㄜ〾",
  "]"=> "ㆤ", "}"=> "ㆥ", "("=> "ㆮ", "L"=> "ㆯ",
  "["=> "ㆦ", "{"=> "ㆧ", ":"=> "ㆲ",
  "+"=> "ㆭ", "\$"=> "ㆱ", "#"=> "ㆰ",  "="=> "ㄫ",
  "&"=> "ㆨ"
};

my @tones = ('', '',
    "ˊ",   "ˇ",   "ˋ ",
    "˪",   "˫",   "ㆷ",  "ㆷ ͘",
    "ㆴ",  "ㆴ ͘", "ㆶ",  "ㆶ ͘",
    "ㆵ",  "ㆵ ͘"
);

local @ARGV = 'usrfont.lst';
while (<>) {
    next if /^\./;
    /^(m3|k) +(\S)(\S) +(.+),(\d+)/ or exit print $_;
    my ($font, $hi, $lo, $keys, $tone) = ($1, sprintf("%02x", ord $2), sprintf("%02x", ord $3), $4, $5);
    next unless $font eq 'm3';
    $keys = join '', map { $bpmf->{$_} } split //, $keys;
    print qq!"$hi$lo": "$keys$tones[$tone]",\n!;
}
